УТ_для_edt/src/Documents/ЭлектронноеПисьмоИсходящее/ЭлектронноеПисьмоИсходящее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектронноеПисьмоИсходящее</name>
  <basedOn>Document.Встреча</basedOn>
  <basedOn>Document.ТелефонныйЗвонок</basedOn>
  <basedOn>Document.ЗапланированноеВзаимодействие</basedOn>
  <basedOn>Document.СообщениеSMS</basedOn>
  <basedOn>Document.КоммерческоеПредложениеКлиенту</basedOn>
  <basedOn>Document.CRM_Интерес</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоИсходящее</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>CRM_АдресХранилищаФайлов</name>
    <comment>Служебный реквизит, используется для механизма шаблонов</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИзHTMLФайла</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Предмет</name>
    <type>
      <types>DefinedType.ПредметВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РазрешеноРедактирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РедактироватьТекстИсходногоПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьИзСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ТекстИзРассылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ТипОтвета</name>
    <type>
      <types>EnumRef.CRM_ТипыОтвета</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийЗаголовок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщенияОтправкаIMAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторыОснований</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПредставление</name>
    <comment>Текстовое описание отправителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейКопий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейСкрытыхКопий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПисьма</name>
    <type>
      <types>EnumRef.СтатусыИсходящегоЭлектронногоПисьма</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовЭлектронныхПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВзаимодействиеОснование</name>
    <type>
      <types>DocumentRef.РассылкаКлиентам</types>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЗапланированноеВзаимодействие</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.Встреча</types>
      <types>DocumentRef.СообщениеSMS</types>
      <types>CatalogRef.ВидыОповещенийКлиентам</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОДоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОПрочтении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьТелоИсходногоПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьТелоИсходногоПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьПослеОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Папка</name>
    <type>
      <types>CatalogRef.ПапкиЭлектронныхПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКогдаОтправить</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальностиОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИдентификаторСообщенияОтправкаIMAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Избранный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтправительАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтправительКонтакт</name>
    <type>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      <types>CatalogRef.CRM_ПотенциальныеКлиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьВАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиПисьма</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиОтвета</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиСкрытыхКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НепринятыеВложения</name>
    <attributes>
      <name>ИмяВложение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПисьмаВложения</name>
    <attributes>
      <name>Письмо</name>
      <type>
        <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
        <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомерВоВложениях</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.CRM_Теги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартДокументы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.КоммерческоеПредложениеКлиенту</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>DefinedType.ПрисоединенныйФайл</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПечатнойФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/CommonModules/CRM_ВзаимодействияКлиент/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Взаимодействия"
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАМНЫЙ ИНТЕРФЕЙС

// Открывает форму нового документа "Электронное письмо исходящее"
// с переданными в процедуру параметрами.
//
// Параметры:
//  Отправитель  				- СправочникСсылка.УчетныеЗаписи	- Учетная запись, с которой выполняется отправка.
//  Получатель   				- Строка, СписокЗначений, Массив	- Список получателей письма.
//  Тема       				  	- Строка 							- Тема письма.
//  Текст        				- Строка 							- Текст письма.
//  СписокФайлов 				- Массив			 				- Вложения письма.
//  Предмет      				- Ссылка 							- Предмет письма.
//	ОписаниеОповещенияОЗакрытии	- ОписаниеОповещения				- Описание оповещения о закрытии.
//
Процедура CRM_ОткрытьФормуОтправкиПочтовогоСообщения(Знач Отправитель = Неопределено, Знач Получатель = Неопределено,
	Знач Тема = "", Знач Текст = "", Знач СписокФайлов = Неопределено, Знач Предмет = Неопределено,
	Знач ОписаниеОповещенияОЗакрытии = Неопределено) Экспорт
	
	ПараметрыПисьма = Новый Структура;
	
	ПараметрыПисьма.Вставить("УчетнаяЗапись", Отправитель);
	ПараметрыПисьма.Вставить("Кому", Получатель);
	ПараметрыПисьма.Вставить("Тема", Тема);
	ПараметрыПисьма.Вставить("Тело", "");

	ПараметрыПисьма.Вставить("Вложения", СписокФайлов);
	ПараметрыПисьма.Вставить("Предмет", Предмет);
	
	Если Отправитель = "ОтправкаПечатнойФормы" Тогда
		ПараметрыПисьма.УчетнаяЗапись = Неопределено;
		ПараметрыПисьма.Вставить("ОтправкаПечатнойФормы", Истина);
	КонецЕсли;
	
	Если ТипЗнч(Текст) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("ОснованиеВходящее", Текст);
		ДанныеЗаполнения.Вставить("Основание", Предмет);
		ПараметрыПисьма.Вставить("Основание", ДанныеЗаполнения);
		ПараметрыПисьма.Удалить("Тема");
	ИначеЕсли ЗначениеЗаполнено(Предмет) Тогда
		ПараметрыПисьма.Вставить("Основание", Предмет);
		Если ТипЗнч(Текст) = Тип("Строка") И Не ПустаяСтрока(Текст) Тогда
			ПараметрыПисьма.Вставить("Тело", Текст);	
		КонецЕсли;
	ИначеЕсли ТипЗнч(Текст) = Тип("Строка") И Не ПустаяСтрока(Текст) Тогда
		ПараметрыПисьма.Вставить("Текст", Текст);	
	КонецЕсли;
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта", ПараметрыПисьма, , , , , ОписаниеОповещенияОЗакрытии);
	
КонецПроцедуры

// Открывает форму нового документа "Электронное письмо исходящее",
// заполненного по данным формы. Используется в командах форм.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма, из команды которой осуществляется вызов
//
Процедура CRM_ОткрытьФормуОтправкиПочтовогоСообщенияПоДаннымФормы(Форма) Экспорт
	
	Если ТипЗнч(Форма.Объект.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		ПараметрыФормы = Новый Структура("Основание",Форма.Объект.ДокументОснование);
		ПараметрыФормы.Вставить("ДанныеЗаполнения", Форма.Объект.ДокументОснование);
	Иначе
		ПараметрыФормы = Новый Структура("Основание",Форма.Объект.Ссылка);
		ПараметрыФормы.Вставить("ДанныеЗаполнения", Форма.Объект.Ссылка);
	КонецЕсли;
	
	ПараметрыФормы.Вставить("Взаимодействие", Форма.Объект.Ссылка);
	Если НЕ ЗначениеЗаполнено(Форма.Объект.КонтактноеЛицо) 
			И НЕ ЗначениеЗаполнено(Форма.Объект.Партнер)
			И НЕ ЗначениеЗаполнено(Форма.Объект.ПотенциальныйКлиент) Тогда
		Возврат;
	КонецЕсли;
	СписокEmail	= Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(Форма.Объект.Партнер) Тогда
		Контакт = ?(ЗначениеЗаполнено(Форма.Объект.КонтактноеЛицо),Форма.Объект.КонтактноеЛицо,Форма.Объект.Партнер);
	Иначе
		Контакт = Форма.Объект.ПотенциальныйКлиент;
	КонецЕсли;	
			
	МассивEmail = CRM_ВзаимодействияВызовСервера.ПолучитьМассивEmail(Контакт);

	Для Каждого ЭлементМассива Из МассивEmail Цикл
		СписокEmail.Добавить(ЭлементМассива.Контакт, ЭлементМассива.Значение);
	КонецЦикла;	
	Если СписокEmail.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не указан Email контактного лица или потенциального клиента';en='No email of contact person or potential customer'"));
	ИначеЕсли СписокEmail.Количество() = 1 Тогда
		ПараметрыФормы.Вставить("Кому", СписокEmail);
	Иначе
		ПараметрыФормы.Вставить("ТолькоКому", Истина);
		ПараметрыФормы.Вставить("Владелец", Форма);
		ОповещениеВыбораEmail	= Новый ОписаниеОповещения("ОбработкаВыбораEmail", ЭтотОбъект, ПараметрыФормы);
		СписокEmail.ПоказатьВыборЭлемента(ОповещениеВыбораEmail);
		Возврат;
	КонецЕсли;
	
	
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта", ПараметрыФормы, Форма);
	
КонецПроцедуры

// Осуществляет телефонный звонок по данным формы. Используется в командах форм. 
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
Процедура CRM_Позвонить(Форма) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Форма.Объект.КонтактноеЛицо) И НЕ ЗначениеЗаполнено(Форма.Объект.Партнер) И НЕ ЗначениеЗаполнено(Форма.Объект.ПотенциальныйКлиент) Тогда
		Возврат;
	ИначеЕсли НЕ сфпСофтФонПроКлиент.сфпПроверитьДоступностьСофтФон(Истина) Тогда
		Возврат;
	КонецЕсли;
	СписокТелефонов	= Новый СписокЗначений;
	Если ЗначениеЗаполнено(Форма.Объект.Партнер) Тогда
		МассивКонтактов = Новый Массив;
		МассивКонтактов.Добавить(Форма.Объект.КонтактноеЛицо);
		МассивКонтактов.Добавить(Форма.Объект.Партнер);
		МассивТелефонов = CRM_ВзаимодействияВызовСервера.сфпПолучитьМассивТелефонов(МассивКонтактов);		
	ИначеЕсли ЗначениеЗаполнено(Форма.Объект.ПотенциальныйКлиент) Тогда
		МассивКонтактов = Новый Массив;
		МассивКонтактов.Добавить(Форма.Объект.ПотенциальныйКлиент);		
		МассивТелефонов = CRM_ВзаимодействияВызовСервера.сфпПолучитьМассивТелефонов(МассивКонтактов);				
	КонецЕсли;		
	Для Каждого ЭлементМассива Из МассивТелефонов Цикл
		СписокТелефонов.Добавить(ЭлементМассива.Значение, ЭлементМассива.Представление);
	КонецЦикла;	
	ДанныеЗаполнения	= Новый Структура;
	Если ТипЗнч(Форма.Объект.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		ДанныеЗаполнения.Вставить("Основание",	Форма.Объект.ДокументОснование);	
	Иначе
		ДанныеЗаполнения.Вставить("Основание",	Форма.Объект.Ссылка);	
	КонецЕсли;
	ДанныеЗаполнения.Вставить("Взаимодействие", Форма.Объект.Ссылка);
	ДанныеЗаполнения.Вставить("КонтактноеЛицо", Форма.Объект.КонтактноеЛицо);
	Если СписокТелефонов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не указан номер телефона';en='Missing phone number'"));
	ИначеЕсли СписокТелефонов.Количество() = 1 Тогда
		ОповещениеВыбораТелефона(СписокТелефонов[0], ДанныеЗаполнения);
	Иначе
		ОповещениеВыбораТелефона	= Новый ОписаниеОповещения("ОповещениеВыбораТелефона", ЭтотОбъект, ДанныеЗаполнения);
		СписокТелефонов.ПоказатьВыборЭлемента(ОповещениеВыбораТелефона);
	КонецЕсли;
	
КонецПроцедуры

// Дата взаимодействия начало выбора
//
// Параметры:
//  Объект				 - Произвольный	 - Объект.
//  Элемент				 - ПолеФормы 	 - Поле формы.
//  ДанныеВыбора		 - СписокЗначений  - Данные выбора.
//  СтандартнаяОбработка - Булево	 - Признак выполнения стандартной (системной) обработки события.
//  СтруктураПараметров	 - Структура	 - Структура параметров.
//  РежимОткрытияОкна	 - РежимОткрытияОкна  	 - Режим открытия окна.
//
Процедура ДатаВзаимодействияНачалоВыбора(Объект, Элемент, ДанныеВыбора, СтандартнаяОбработка, СтруктураПараметров, РежимОткрытияОкна = Неопределено) Экспорт
	СтандартнаяОбработка = Ложь;
	
	Параметры = Новый Структура();
	Параметры.Вставить("РежимВыбора", Истина);
	
	Для Каждого ЭлементСтруктуры Из СтруктураПараметров Цикл
		Параметры.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;

	ФормаВыбора = ОткрытьФорму("Обработка.CRM_КалендарьМенеджера.Форма", Параметры, Элемент, Объект.Ссылка,,,, РежимОткрытияОкна);
КонецПроцедуры

// Процедура оповещает форму объекта-основания о том, что контакт создан и записан.
//
// Параметры:
//	Ссылка			- СправочникСсылка	- Ссылка на созданный контакт.
//	Наименование	- Строка			- Наименование контакта.
//	Основание		- Документссылка	- Ссылка на взаимодействие - основание.
//
Процедура КонтактСоздан(Ссылка, Наименование, Основание) Экспорт

	ВозвращаемыйПараметр = Новый Структура;
	ВозвращаемыйПараметр.Вставить("Ссылка",       Ссылка);
	ВозвращаемыйПараметр.Вставить("Наименование", Наименование);
	ВозвращаемыйПараметр.Вставить("Основание",    Основание);
	Оповестить("Контакт создан",ВозвращаемыйПараметр);

КонецПроцедуры // КонтактСоздан()


// Дата взаимодействия при изменении
//
// Параметры:
//  Объект				 - Произвольный	 - Объект.
//  Элемент				 - ПолеФормы 	 - Поле формы. 
//  СтруктураПараметров	 - Структура	 - Структура параметров.
//
Процедура ДатаВзаимодействияПриИзменении(Объект, Элемент, СтруктураПараметров) Экспорт
	
	Важность = Неопределено;
	ТипУслуги  = Неопределено;
	Дата     = '00010101000000';
	Пользователь  = Неопределено;
	
	Если СтруктураПараметров.Свойство("Автор") Тогда
		Пользователь = СтруктураПараметров.Автор;
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Пользователь) И СтруктураПараметров.Свойство("Ответственный") Тогда
		Пользователь = СтруктураПараметров.Ответственный;
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("Клиент") Тогда
		Клиент = СтруктураПараметров.Клиент;
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("ТипУслуги") Тогда
		ТипУслуги = СтруктураПараметров.ТипУслуги;
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("ДатаПоУмолчанию") Тогда
		Дата = СтруктураПараметров.ДатаПоУмолчанию;
	КонецЕсли;
	
	СтруктураВозможностиПланирования = CRM_ВзаимодействияСервер.ПроверитьВозможностьПланирования(Дата, Пользователь, Клиент, ТипУслуги);
	
	Если НЕ СтруктураВозможностиПланирования.МожноПланировать Тогда
		//Элемент.Значение = '00010101000000';
		
		СтруктураПараметров.Вставить("Дата", '00010101000000');
		
		НовоеСообщение = Новый СообщениеПользователю();
		НовоеСообщение.УстановитьДанные(Элемент);
		НовоеСообщение.Текст = "Планирование возможно только до " + Формат(СтруктураВозможностиПланирования.ДатаПланирования, "ДЛФ=DD") + " включительно!";
		НовоеСообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры


// Дата взаимодействия обработка выбора
//
// Параметры:
//  Объект				 - Произвольный	 - Объект.
//  Элемент				 - ПолеФормы 	 - Поле формы. 
//  ВыбранноеЗначение	 - Произвольный	 - Выбранное значение.
//  СтандартнаяОбработка - Булево	 - Признак выполнения стандартной (системной) обработки события.
//  СтруктураПараметров	 - Структура	 - Структура параметров.
//
Процедура ДатаВзаимодействияОбработкаВыбора(Объект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка, СтруктураПараметров) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Работает в связке с CRM_ВзаимодействияКлиент.CRM_ОткрытьФормуОтправкиПочтовогоСообщенияПоДаннымФормы
Процедура ОбработкаВыбораEmail(РезультатВыбора, ПараметрыФормы) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда Возврат; КонецЕсли;
	СписокАдресов = Новый СписокЗначений;
	СписокАдресов.Добавить(РезультатВыбора.Значение, РезультатВыбора.Представление);
	
	Владелец = Неопределено;
	Если ПараметрыФормы.Свойство("Владелец") Тогда
		Владелец = ПараметрыФормы.Владелец;
		ПараметрыФормы.Удалить("Владелец");
	КонецЕсли;
	
	ПараметрыФормы.Вставить("Кому", СписокАдресов);
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта", ПараметрыФормы, Владелец);

КонецПроцедуры

// Работает в связке с CRM_ВзаимодействияКлиент.CRM_Позвонить
Процедура ОповещениеВыбораТелефона(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда Возврат; КонецЕсли;
	
	сфпСофтФонПроКлиент.сфпПозвонить(РезультатВыбора.Значение, ДополнительныеПараметры.КонтактноеЛицо, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти
